[
  {
    "id": 1,
    "time": "08:12",
    "text": "Te cuento po, me corté la mano con una lámina en el taller. ¿Qué hago? 😰",
    "media": { "type": "image", "content": "dist/assets/hand.jpg" },
    "topic": "diat",
    "options": [
      {
        "text": "Avísale de inmediato a tu jefatura para que emita la DIAT y te acompaño al centro de la mutual/ISL.",
        "score": 2,
        "reaction": "¡Gracias, no sabía eso! Voy a buscar ayuda altiro.",
        "bossMessage": "✅ Bien hecho activando la DIAT dentro de 24 h y derivando al organismo administrador; así cumples la norma y aseguras atención inmediata.",
        "feedback": "✅ +2 pts. Activaste el proceso de denuncia y atención por el seguro laboral.",
        "topic": "diat"
      },
      {
        "text": "Dejate la venda nomás y veamos si se te pasa.",
        "score": 0,
        "reaction": "¿Seguro? Es que sangra caleta…",
        "bossMessage": "❌ ¡Ojo! Ignorar un accidente grave puede traer sanciones y agravar la lesión.",
        "feedback": "❌ 0 pts. Minimizas el accidente y retrasas cobertura.",
        "cause": "No se activó la denuncia legal dentro del plazo de 24 hrs ni se aseguró cobertura por Ley 16.744.",
        "recommendation": "Reporta TODO accidente de inmediato a jefatura o mutual/ISL para resguardar la salud del trabajador y cumplir la ley.",
        "helpSection": "ayuda-4",
        "topic": "diat"
      },
      {
        "text": "Anda a tu ISAPRE/FONASA solo si es urgencia vital; después se deriva al organismo administrador (por ley usa red del OA).",
        "score": 1,
        "reaction": "¿Y no tengo que hacer algo más?",
        "bossMessage": "⚠️ En urgencia vital es excepcional, pero debe derivarse al OA. La ley exige red del organismo administrador.",
        "feedback": "🟡 +1 pt. Urgencia vital es excepcional y requiere posterior derivación al OA.",
        "cause": "Aunque ISAPRE/FONASA puede atender en urgencia vital, el flujo correcto es derivación inmediata al OA según Ley 16.744.",
        "recommendation": "Prioriza derivación directa al organismo administrador; solo casos de urgencia vital van inicialmente a servicios de salud público/privado con posterior coordinación.",
        "helpSection": "ayuda-3",
        "topic": "diat"
      }
    ]
  },
  {
    "id": 2,
    "time": "08:15",
    "text": "Mi jefa hoy no está. ¿Sin ella no se puede denunciar?",
    "topic": "diat",
    "options": [
      {
        "text": "Solo la empresa puede.",
        "score": 0,
        "reaction": "Pucha… entonces espero.",
        "bossMessage": "❌ ¡Error! Cualquier testigo o el mismo accidentado puede denunciar, no esperen por mí.",
        "feedback": "❌ 0 pts. La ley permite que otras personas denuncien también.",
        "cause": "Se asume que solo el empleador puede denunciar, pero la Ley 16.744 autoriza al trabajador, testigos, médico o CPHS.",
        "recommendation": "Realiza o apoya la autodenuncia directamente en el organismo administrador (mutual/ISL) sin esperar al empleador.",
        "helpSection": "ayuda-4",
        "topic": "diat"
      },
      {
        "text": "Tú puedes hacer la DIAT y yo te ayudo; igual avisamos a la empresa.",
        "score": 2,
        "reaction": "¡Ya! Gracias por apoyarme.",
        "bossMessage": "✅ Excelente iniciativa. La autodenuncia asegura la atención oportuna.",
        "feedback": "✅ +2 pts. Empoderas al trabajador y das continuidad al proceso.",
        "topic": "diat"
      },
      {
        "text": "Esperemos a mañana.",
        "score": 0,
        "reaction": "¿Y si se me infecta?",
        "bossMessage": "❌ ¡Jamás postergar! La denuncia debe ser dentro de las 24 horas ideales.",
        "feedback": "❌ 0 pts. Posponer es riesgoso y puede afectar cobertura.",
        "cause": "Postergar la denuncia más allá de 24 hrs puede complicar la cobertura y agravar la lesión.",
        "recommendation": "Denuncia el mismo día del accidente para garantizar la atención médica y validez de las prestaciones.",
        "helpSection": "ayuda-4",
        "topic": "diat"
      }
    ]
  },
  {
    "id": 3,
    "time": "08:22",
    "topic": "traslado",
    "text": "Me duele harto. ¿Voy en micro o pido ambulancia?",
    "options": [
      {
        "text": "Si hay sangrado importante o mareo, pide traslado; si no, te llevo directo a la mutual/ISL.",
        "score": 2,
        "topic": "traslado",
        "reaction": "¡Perfecto! Mejor no me la juego.",
        "bossMessage": "✅ Muy bien priorizando el traslado seguro. Los gastos de traslado son parte de la cobertura.",
        "feedback": "✅ +2 pts. El traslado y sus gastos forman parte de las prestaciones médicas."
      },
      {
        "text": "Pasa por tu casa a cambiarte y después vamos.",
        "score": 0,
        "topic": "traslado",
        "cause": "Retrasar la atención por temas no urgentes compromete la salud y puede agravar la lesión.",
        "recommendation": "En accidentes del trabajo, la prioridad es atención inmediata en el centro asignado.",
        "helpSection": "prestaciones-medicas",
        "reaction": "¿No será perder tiempo…?",
        "bossMessage": "❌ No pierdan tiempo valioso. La ropa da igual, la salud es primero.",
        "feedback": "❌ 0 pts. Desvías la urgencia y dilatas la atención."
      },
      {
        "text": "Anda a la clínica más cercana porque es más rápida.",
        "score": 1,
        "topic": "traslado",
        "cause": "Aunque es válido por urgencia vital, no es el camino óptimo si hay convenio.",
        "recommendation": "Siempre prioriza el centro con convenio del empleador (mutual/ISL) para evitar cobros adicionales.",
        "helpSection": "organismo-administrador",
        "reaction": "No sabía que podía…",
        "bossMessage": "⚠️ Sirve por Ley de Urgencia, pero idealmente va directo al convenio para no pagar extra.",
        "feedback": "🟡 +1 pt. Es válido en urgencia, pero debe derivarse y calificar."
      }
    ]
  },
  {
    "id": 4,
    "time": "10:05",
    "topic": "prestaciones",
    "text": "Me suturaron y me dieron indicaciones. ¿Esto lo pago yo? 💸",
    "options": [
      {
        "text": "Están cubiertos procedimientos, medicamentos, curaciones y controles hasta tu alta.",
        "score": 2,
        "topic": "prestaciones",
        "reaction": "¡Menos mal! Pensé que iba a salir caro.",
        "bossMessage": "✅ Correcto: las prestaciones médicas de la Ley 16.744 se otorgan gratuitamente hasta la curación o secuelas.",
        "feedback": "✅ +2 pts. Cubre todo gratuitamente hasta recuperación o secuelas."
      },
      {
        "text": "Solo la consulta; los medicamentos corren por tu cuenta.",
        "score": 0,
        "topic": "prestaciones",
        "cause": "La Ley 16.744 cubre íntegramente prestaciones médicas, medicamentos y procedimientos.",
        "recommendation": "Nunca debe el trabajador pagar por atención ni insumos en accidentes laborales.",
        "helpSection": "prestaciones-medicas",
        "reaction": "Uff, me dejaron medio quebrado.",
        "bossMessage": "❌ ¡No! Nico no debe pagar nada. Infórmate bien sobre la Ley 16.744.",
        "feedback": "❌ 0 pts. ¡No! Nico no debe pagar nada. Infórmate bien sobre la Ley 16.744."
      },
      {
        "text": "Solo si faltas al trabajo te cubren.",
        "score": 0,
        "topic": "prestaciones",
        "cause": "La cobertura de prestaciones médicas es independiente de si hay reposo o no.",
        "recommendation": "Todos los tratamientos están cubiertos desde la DIAT hasta el alta, con o sin licencia.",
        "helpSection": "prestaciones-medicas",
        "reaction": "¿Entonces no era accidente laboral?",
        "bossMessage": "❌ Falso. La cobertura aplica con o sin licencia médica.",
        "feedback": "❌ 0 pts. Falso. La cobertura aplica con o sin licencia médica."
      }
    ]
  },
  {
    "id": 5,
    "time": "10:15",
    "topic": "subsidio",
    "text": "El doc dice que quizá no necesito reposo. ¿Pierdo beneficios?",
    "options": [
      {
        "text": "Aunque no tengas reposo, igual tienes prestaciones médicas.",
        "score": 2,
        "topic": "subsidio",
        "reaction": "¡Ah buena! Pensé que perdía todo.",
        "bossMessage": "✅ Exacto. Nico vuelve a trabajar pero sigue con tratamiento cubierto.",
        "feedback": "✅ +2 pts. La cobertura médica se mantiene aunque no haya reposo."
      },
      {
        "text": "Sin licencia, pagas todo tú.",
        "score": 0,
        "topic": "subsidio",
        "cause": "Confundes subsidio (solo con reposo) con prestaciones médicas (siempre cubiertas).",
        "recommendation": "Las prestaciones médicas son independientes del reposo. El subsidio es aparte.",
        "helpSection": "subsidio-incapacidad",
        "reaction": "Pucha, no tenía idea…",
        "bossMessage": "❌ Error grave. No asustes a Nico, el seguro sigue operando.",
        "feedback": "❌ 0 pts. Error grave. No asustes a Nico, el seguro sigue operando."
      },
      {
        "text": "Entonces no necesitas DIAT.",
        "score": 0,
        "topic": "diat",
        "cause": "La DIAT es obligatoria aunque no haya reposo; es para registrar y calificar el accidente.",
        "recommendation": "Siempre hacer DIAT dentro de 24 hrs, independiente del reposo médico.",
        "helpSection": "diat",
        "reaction": "Pensé que si volvía a la pega no era necesaria…",
        "bossMessage": "❌ ¡No! DIAT es obligatoria aunque vuelvas a trabajar.",
        "feedback": "❌ 0 pts. ¡No! DIAT es obligatoria aunque vuelvas a trabajar."
      }
    ]
  },
  {
    "id": 6,
    "time": "11:40",
    "topic": "licencia",
    "text": "La secretaria dice que la empresa debe tramitar la licencia 5/6. Si no la reciben, ¿qué hago?",
    "media": { "type": "document", "content": "dist/assets/licencia_medica.pdf", "fileName": "Licencia_Medica_Nico.pdf", "pages": "1 pág • PDF", "thumbnail": "dist/assets/blur.jpg" },
    "options": [
      {
        "text": "La presentas directamente en el organismo administrador; si falta la DIAT, la hacemos.",
        "score": 2,
        "topic": "licencia",
        "reaction": "¡Buena! No sabía que podía hacerlo directo.",
        "bossMessage": "✅ Si RR.HH. no recibe la licencia 5/6, la presentas directo al organismo. Recuerda plazos: empleador 3 días hábiles si la recibe; término por no presentación: 15 días en accidentes / 30 en enfermedades.",
        "feedback": "✅ +2 pts. Bien resuelto. Si RRHH falla, el trabajador puede gestionar su licencia directo."
      },
      {
        "text": "Llévala a la ISAPRE.",
        "score": 0,
        "topic": "licencia",
        "cause": "Las licencias por accidentes laborales deben tramitarse por el organismo administrador (mutual/ISL), no Isapre.",
        "recommendation": "Lleva la licencia 5/6 directamente al organismo administrador si la empresa no la gestiona.",
        "helpSection": "subsidio-incapacidad",
        "reaction": "Pero si es laboral…",
        "bossMessage": "❌ Si la llevas a Isapre la van a rechazar por origen laboral. Pérdida de tiempo.",
        "feedback": "❌ 0 pts. Si la llevas a Isapre la van a rechazar por origen laboral. Pérdida de tiempo."
      },
      {
        "text": "Espera a que la empresa vuelva.",
        "score": 0,
        "topic": "licencia",
        "cause": "Los plazos para presentar licencias son fatales (3 días hábiles desde recepción). Esperar puede perderlo.",
        "recommendation": "Si el empleador no puede, el trabajador presenta directo al organismo administrador.",
        "helpSection": "subsidio-incapacidad",
        "reaction": "¿Y si se pasa el plazo?",
        "bossMessage": "❌ Los plazos de licencia son fatales. No hay que esperar.",
        "feedback": "❌ 0 pts. Los plazos de licencia son fatales. No hay que esperar."
      }
    ]
  },
  {
    "id": 7,
    "time": "Martes, 08:55",
    "topic": "pruebas",
    "text": "Voy camino a control. ¿Sirve que guarde fotos y el parte con las circunstancias?",
    "options": [
      {
        "text": "Sí, guarda fotos, testigos y documentos; te ayudan a acreditar circunstancias y trayecto si aplica.",
        "score": 2,
        "topic": "pruebas",
        "reaction": "¡Perfecto! Tomé fotos de todo.",
        "sticker": "dist/assets/sticker.png",
        "media": { "type": "image", "content": "dist/assets/blur.jpg" },
        "bossMessage": "✅ Super bien. Esos respaldos son claves si la mutual cuestiona el origen.",
        "feedback": "✅ +2 pts. Super bien. Esos respaldos son claves si la mutual cuestiona el origen."
      },
      {
        "text": "No hace falta, con la DIAT basta.",
        "score": 0,
        "topic": "pruebas",
        "cause": "Las pruebas (fotos, parte, testigos) son fundamentales para sustentar el caso ante posibles rechazos.",
        "recommendation": "Siempre documente circunstancias: fotos, testimonio de testigos, parte de carabineros si aplica.",
        "helpSection": "diat",
        "reaction": "Chuta, ya las borré…",
        "bossMessage": "❌ Mal consejo. Sin pruebas es más difícil defender el caso si lo rechazan.",
        "feedback": "❌ 0 pts. Mal consejo. Sin pruebas es más difícil defender el caso si lo rechazan."
      }
    ]
  },
  {
    "id": 8,
    "time": "12:00",
    "topic": "trivia",
    "text": "Oye wn, estuve leyendo el manual que me pasaron y caché unos datos que en volá tú no sabíai. ¿Te pongo a prueba? 😎",
    "options": [
      { "text": "¡Dale! Tira los datos a ver si sabís tanto. Jajaja", "score": 0, "topic": "trivia", "reaction": "Ya, prepárate que aquí te pillo fijo. ¡Vamos!" }
    ]
  },
  {
    "id": 9,
    "time": "12:01",
    "topic": "trayecto",
    "text": "1️⃣ ¿Sabíai que si vai de la pega a la casa y te desviai a comprar pan, te sigue cubriendo el seguro de trayecto?",
    "options": [
      {
        "text": "¡Ooh que buen dato wn! No tenía idea. 👍",
        "score": 0,
        "topic": "trayecto",
        "style": "truth",
        "cause": "Confundes el trayecto directo con cualquier parada personal; los desvíos rompen la cobertura.",
        "recommendation": "El trayecto debe ser directo sin interrupciones por motivos personales. Excepción SUSESO: necesidad objetiva habitual (dejar hijxs).",
        "helpSection": "trayecto",
        "reaction": "❌ ¡Puta el weón! Te cuentié pesao' JKSADKA. El trayecto tiene que ser directo, sin desvíos personales cagaste con el seguro. Excepción SUSESO: interrupción habitual por necesidad objetiva (ej. dejar hijxs) puede no romper nexo.",
        "feedback": "❌ 0 pts. El desvío por motivos personales interrumpe la cobertura de trayecto."
      },
      {
        "text": "Chamullento ql, aonde la viste. Esa es mula. 👎",
        "score": 2,
        "topic": "trayecto",
        "style": "myth",
        "reaction": "✅ ¡Buena! Estái vivo. Es chamullo: el trayecto debe ser directo y sin desvíos personales. Excepción: interrupción habitual por necesidad objetiva (ej. dejar hijxs) puede no romper el nexo por jurisprudencia SUSESO.",
        "feedback": "✅ +2 pts. El trayecto debe ser directo y no interrumpido por fines personales."
      }
    ]
  },
  {
    "id": 10,
    "time": "12:02",
    "topic": "prestaciones",
    "text": "2️⃣ ¿Y esta? En la Mutual tengo que pagar la atención de urgencia y después pedir el reembolso con la boleta.",
    "options": [
      {
        "text": "Claro, como en la farmacia. Verdad. 👍",
        "score": 0,
        "topic": "prestaciones",
        "style": "truth",
        "cause": "Confundes la Ley 16.744 con seguros privados; la Ley 16.744 es 100% gratuita sin copagos.",
        "recommendation": "Nunca debes pagar en el momento. Si alguien te cobra, reclama al organismo administrador.",
        "helpSection": "prestaciones-medicas",
        "reaction": "❌ ¡Te volví a pillar! JSDKFJS. El seguro es gratuito, no tení que sacar ni una gamba del bolsillo.",
        "feedback": "❌ 0 pts. La Ley 16.744 no contempla copagos ni reembolsos; es gratuita."
      },
      {
        "text": "¡La mansa mentira hno! No se paga ni un peso. 👎",
        "score": 2,
        "topic": "prestaciones",
        "style": "myth",
        "reaction": "✅ ¡Eso! La tení clarita. Todo el tratamiento, hasta los remedios, son gratis.",
        "feedback": "✅ +2 pts. Cobertura total sin costo para el trabajador."
      }
    ]
  }
]
